app/Views/dashboard/manager/manager.php

if (empty($items) || ! is_array($items)) {
    try {
        $inventoryModel = new \App\Models\InventoryModel();
        $items = $inventoryModel->findAll();
---
SELECT *
FROM `inventory`