app/Controllers/Auth.php

                        } else {
                            $db = \Config\Database::connect();
                            if ($db->tableExists('user_warehouses')) {
                                $uw = $db->table('user_warehouses')->where('user_id', $user['id'])->get()->getRowArray();
---
SELECT *
FROM `user_warehouses`
WHERE `user_id` = '3'