app/Controllers/Inventory.php

SELECT *
FROM `inventory`
ORDER BY `id` ASC
---
    public function index()
    {
        if (! session()->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $model = new InventoryModel();
        $items = $model->orderBy('id', 'ASC')->findAll();

SELECT *
FROM `inventory`
WHERE `inventory`.`id` = '14'
DELETE FROM `inventory`
WHERE `id` IN ('14')
---
    public function delete($id = null)
    {
        if (! session()->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $model = new InventoryModel();

        if (empty($id) || ! is_numeric($id)) {
            session()->setFlashdata('error', 'Invalid item id');
            return redirect()->to('/inventory');
        }

        $exists = $model->find($id);
        if (! $exists) {
            session()->setFlashdata('error', 'Item not found');
            return redirect()->to('/inventory');
        }

        $model->delete($id);