app/Controllers/StaffTaskController.php

SELECT *
FROM `staff_tasks`
WHERE `status` = 'Pending'
ORDER BY `created_at` ASC
---
    public function getPendingTasks()
    {
        if (!session()->get('isLoggedIn')) {
            return $this->response->setStatusCode(401)->setJSON(['error' => 'Unauthorized']);
        }

        // Allow both staff and managers to view tasks
        $role = session('role');
        if (!in_array($role, ['staff', 'manager'])) {
            return $this->response->setStatusCode(403)->setJSON(['error' => 'Insufficient permissions']);
        }

        try {
            $warehouseId = $this->request->getGet('warehouse_id');
            // Default to session warehouse if not provided by request
            if (empty($warehouseId)) {
                $warehouseId = session('warehouse_id') ?: null;
            }

            // Get only truly pending tasks (not scanned or completed)
            $tasks = $this->staffTaskModel->where('status', 'Pending');