app/Controllers/WorkforceController.php

    public function listUsers()
    {
        $model = new UserModel();
        $users = $model->select('id, name, email, role, created_at, updated_at')->orderBy('id', 'ASC')->findAll();
---
SELECT `id`, `name`, `email`, `role`, `created_at`, `updated_at`
FROM `users`
ORDER BY `id` ASC

    public function create()
    {
        $data = $this->request->getJSON(true);
        if (! $data || empty($data['name']) || empty($data['email'])) {
            return $this->response->setStatusCode(400)->setJSON(['error' => 'Missing name or email']);
        }

        $model = new UserModel();

        $insertData = [
            'name'  => $data['name'],
            'email' => $data['email'],
            'role'  => $data['role'] ?? 'staff',
        ];

        if (! empty($data['password'])) {
            $insertData['password'] = password_hash($data['password'], PASSWORD_DEFAULT);
        }

        $insertId = $model->insert($insertData);
---
INSERT INTO `users` (`name`, `email`, `role`, `password`, `created_at`, `updated_at`) VALUES ('Alice Johnson', 'alice@example.com', 'staff', '$2y$10$2mV18NuxDtemee0g0exy7ej2aK1SwtfV2ZkuFghDg1GqSSv8J9aQe', '2025-10-29 23:56:05', '2025-10-29 23:56:05')