app/Models/InboundReceiptModel.php

    public function getPendingReceipts()
    {
        return $this->where('status', 'Pending')
                    ->orderBy('created_at', 'DESC')
                    ->findAll();
---
SELECT *
FROM `inbound_receipts`
WHERE `status` = 'Pending'
ORDER BY `created_at` DESC