app/Models/InventoryModel.php

    public function findBySkuAndWarehouse($sku, $warehouseId = null)
    {
        $builder = $this->builder();
        $builder->where('sku', $sku);

        if ($warehouseId !== null) {
            $builder->where('warehouse_id', $warehouseId);
        }

        return $builder->get()->getRowArray();
---
SELECT *
FROM `inventory`
WHERE `sku` = 'PLB-PVC-2'
AND `warehouse_id` = 1

    public function getByWarehouse($warehouseId)
    {
        return $this->where('warehouse_id', $warehouseId)
                   ->orderBy('name', 'ASC')
                   ->findAll();
---
SELECT *
FROM `inventory`
WHERE `warehouse_id` = 2
ORDER BY `name` ASC

    public function getLowStockItems($warehouseId = null)
    {
        $builder = $this->where('quantity <=', 10);

        if ($warehouseId !== null) {
            $builder->where('warehouse_id', $warehouseId);
        }

        return $builder->findAll();
---
SELECT *
FROM `inventory`
WHERE `quantity` <= 10