app/Models/RecentScanModel.php

SELECT *
FROM `recent_scans`
WHERE `user_id` = '20'
AND `status` = 'Pending'
ORDER BY `created_at` ASC
---
    public function listForUser($userId)
    {
        return $this->where('user_id', $userId)
                    ->where('status', 'Pending')
                    ->orderBy('created_at', 'ASC')
                    ->findAll();