app/Models/StaffTaskModel.php

SELECT *
FROM `staff_tasks`
WHERE `reference_no` = 'PO-1205'
AND `item_id` = 7
AND `status` = 'Pending'
 LIMIT 1
---
    public function createTask($data)
    {
        // Validate required fields
        $requiredFields = ['reference_no', 'warehouse_id', 'item_id', 'item_name', 'quantity', 'movement_type'];
        foreach ($requiredFields as $field) {
            if (!isset($data[$field])) {
                throw new \InvalidArgumentException("Missing required field: {$field}");
            }
        }

        // Check if task already exists for this reference and item
        $existingTask = $this->where('reference_no', $data['reference_no'])
                            ->where('item_id', $data['item_id'])
                            ->where('status', 'Pending')
                            ->first();

INSERT INTO `staff_tasks` (`movement_id`, `reference_no`, `warehouse_id`, `item_id`, `item_name`, `item_sku`, `quantity`, `movement_type`, `status`, `assigned_by`, `notes`, `created_at`, `updated_at`) VALUES (8, 'PO-1205', 1, 7, 'PVC Pipe 2in', 'PLB-PVC-2', 200, 'IN', 'Pending', NULL, 'Inbound receipt approved - scan items to confirm receipt', '2025-11-13 05:12:23', '2025-11-13 05:12:23')
---
        ];

        try {
            $taskId = $this->insert($taskData);