app/Models/StockMovementModel.php

INSERT INTO `stock_movements` (`transaction_number`, `items_in_progress`, `order_number`, `id`, `quantity`, `company_name`, `movement_type`, `location`, `status`) VALUES ('TXN-1763010743-209', 1, 'PO-1205', 7, 200, 'Pipe & Plumbing Co', 'in', 'Main Warehouse', 'approved')
---
    public function createMovement($data)
    {
        // Validate required fields
        $requiredFields = ['transaction_number', 'order_number', 'id', 'quantity', 'movement_type'];
        foreach ($requiredFields as $field) {
            if (!isset($data[$field])) {
                throw new \InvalidArgumentException("Missing required field: {$field}");
            }
        }

        // Set default values
        $movementData = [
            'transaction_number' => $data['transaction_number'],
            'items_in_progress' => $data['items_in_progress'] ?? 1,
            'order_number' => $data['order_number'], // PO-1234, SO-5678, etc.
            'id' => $data['id'], // inventory item id
            'quantity' => $data['quantity'],
            'company_name' => $data['company_name'] ?? 'WeBuild Construction',
            'movement_type' => $data['movement_type'], // 'in' or 'out'
            'location' => $data['location'] ?? 'Warehouse',
            'status' => $data['status'] ?? 'pending'
        ];

        try {
            return $this->insert($movementData);

SELECT `sm`.*, `i`.`name` as `item_name`, `i`.`sku` as `item_sku`, `i`.`warehouse_id`
FROM `stock_movements` `sm`
LEFT JOIN `inventory` `i` ON `i`.`id` = `sm`.`id`
ORDER BY `sm`.`movement_id` DESC
 LIMIT 100
---
    public function getMovementHistory($limit = 50)
    {
        return $this->db->table('stock_movements sm')
            ->select('sm.*, i.name as item_name, i.sku as item_sku, i.warehouse_id')
            ->join('inventory i', 'i.id = sm.id', 'left')
            ->orderBy('sm.movement_id', 'DESC')
            ->limit($limit)
            ->get()
            ->getResultArray();